[
  {
    "id": 1,
    "title": "TIPI",
    "summary": "This app offers a personality assessment based on the 'Ten Item Personality Inventory (TIPI),' a tool grounded in psychological research. TIPI is a reliable method for quickly and easily evaluating your personality traits.",
    "description": "This application provides a simplified version of the Big-Five Personality Assessment consisting of five and ten items to diagnose Big-Five personality traits in a short time. Although slightly less accurate than traditional in-depth personality assessments, it has proven reliable in self-assessment, peer assessment and test reproducibility, making it a convenient way to measure personality. Correlations with external related traits also show results in line with predictions, making it an ideal tool when personality traits need to be identified in a short time, or when personality analysis is not the main objective.Translated with DeepL.com (free version)",
    "githubURL": "https://github.com/IkUmO1118/tipi-personality",
    "thumbnail": "/img/tipi.png",
    "skillStack": ["react", "tailwindcss", "typescript", "supabase"],
    "selected": true,
    "createdAt": "2024/10/30"
  },
  {
    "id": 2,
    "title": "1RM.",
    "summary": "1RM. is a tool for coaches offering online training. It allows them to easily manage student lists, training exercises, and track student progress",
    "description": "1RM. is a powerful support tool for online training coaches. Through the app, coaches can manage lists of students, create training menus, track the training volume of each student and manage training methods for each part of the body in one place. 1RM. allows you to track the progress of each student in real time and easily optimise individual training plans. Optimisation is possible. This is an essential app for efficient and effective training instruction.",
    "githubURL": "https://github.com/IkUmO1118/1RM-app",
    "thumbnail": "/img/1rm.png",
    "skillStack": ["react", "tailwindcss", "mongodb"],
    "selected": true,
    "createdAt": "2024/02/24"
  },
  {
    "id": 3,
    "title": "The Wild Oasis",
    "summary": "The Wild Oasis Hotel app allows prospective guests to review, book and manage their stay. Users can view individual cabins and check availability.",
    "description": "The Wild Oasis Hotel app provides a comprehensive tool for guests to experience the best of the hotel's offerings before and during their stay. Potential and registered guests can explore the hotel, discover each cabin's features, and view availability by date. With a user-friendly interface, the app lets guests filter cabins by their maximum capacity, ensuring that each booking meets their needs.Reservations are made easy, with a clear booking system allowing guests to select dates and confirm details. As payments are completed in person upon arrival, reservations are initially marked as 'unconfirmed.' Registered users can view all their past and upcoming bookings, as well as modify or cancel reservations as needed.To enhance the guest experience, new users can create a profile upon sign-up, enabling quicker access and allowing updates to their personal details, making hotel check-ins smoother and more efficient.",
    "githubURL": "https://github.com/IkUmO1118/the-wild-oasis-website",
    "thumbnail": "/img/the-wild-oasis.jpg",
    "skillStack": ["nextjs", "tailwindcss", "supabase"],
    "selected": true,
    "createdAt": "2024/6/12"
  },
  {
    "id": 4,
    "title": "Portfolio Site",
    "summary": "This portfolio site showcases past projects, including websites and applications. It was developed as part of a recurrent assignment",
    "description": "Built with Next.js and Tailwind CSS on the frontend and hosted on AWS EC2, this portfolio site serves as a comprehensive showcase of my work. Visitors can explore various projects, each demonstrating different facets of my technical skills and creative solutions in web and app development. This site reflects my dedication to building user-friendly and functional interfaces and my ability to manage infrastructure on the AWS platform.",
    "githubURL": "https://github.com/IkUmO1118/portfolio-website",
    "thumbnail": "/img/portfolio.png",
    "skillStack": ["nextjs", "tailwindcss", "typescript"],
    "selected": true,
    "createdAt": "2024/10/08"
  },
  {
    "id": 5,
    "title": "Online Chat Messanger",
    "summary": "The Online Chat Messenger allows users to easily connect and communicate with each other via UDP and TCP protocols. Custom chat rooms can also be created.",
    "description": "This 'Online Chat Messenger' project aims to build a real-time, data-first chat application and to develop an understanding of basic server operation and client-server architecture. Step by step, the client connects to the server via UDP through the CLI, starting with a simple system where messages are relayed, progressing to the creation of dedicated chat rooms and sending and receiving messages with token authentication.Translated with DeepL.com (free version)",
    "githubURL": "https://github.com/IkUmO1118/recursion-cs/tree/main/backend-project-2/online-chat-messenger",
    "thumbnail": "/img/the-wild-oasis.png",
    "skillStack": ["python"],
    "selected": false,
    "createdAt": "2024/9/14"
  }
]
